tap "daipeihust/tap"
tap "kortin99/tap"
brew "eza"
brew "fd"
brew "fish"
brew "fnm"
brew "fzf"
brew "git-delta"
brew "gum"
brew "jq"
brew "lazygit"
brew "neovim"
brew "node"
brew "nvm"
brew "pnpm"
brew "ripgrep"
brew "thefuck"
brew "tldr"
brew "uv"
brew "whistle"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zx"
brew "daipeihust/tap/im-select"
brew "kortin99/tap/fzf-tab"
cask "bitwarden"
cask "cherry-studio"
cask "clash-verge-rev"
cask "font-droid-sans-mono-nerd-font"
cask "karabiner-elements"
cask "mac-mouse-fix"
cask "orbstack"
cask "raycast"
cask "switchhosts"
cask "visual-studio-code"
cask "wezterm"
vscode "alefragnani.bookmarks"
vscode "alibaba-cloud.tongyi-lingma"
vscode "antfu.browse-lite"
vscode "antfu.where-am-i"
vscode "bodil.file-browser"
vscode "brandonkirbyson.vscode-animations"
vscode "chaitanyashahare.lazygit"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "gruntfuggly.todo-tree"
vscode "ishiyama.vuejs-peek"
vscode "jacobdufault.fuzzy-search"
vscode "kortin1999.kortin-theme"
vscode "kortin1999.vscode-kortin-vim-pack"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "palmpam.vue2-file-peek"
vscode "rooveterinaryinc.roo-cline"
vscode "silesky.toggle-boolean"
vscode "streetsidesoftware.code-spell-checker"
vscode "subframe7536.custom-ui-style"
vscode "tompollak.lazygit-vscode"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "volartools.volar-ai"
vscode "vscodevim.vim"
vscode "vue.volar"
